KERWINHUGH/woniu/code/stm32/250421/250421_01_串口语音控制/Hardware/Serial.c
#include "stm32f10x.h"                  // Device header
#include "Serial.h"
#include "LED.h"


void dealTask(void);

void Serial_Init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStruct;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_9 ;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStruct);
	
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStruct.GPIO_Pin =  GPIO_Pin_10 ;
	GPIO_Init(GPIOA,&GPIO_InitStruct);
	
	//串口配置
	USART_InitTypeDef USART_InitStruct;
	USART_InitStruct.USART_Mode = USART_Mode_Tx | USART_Mode_Rx;
	USART_InitStruct.USART_HardwareFlowControl =USART_HardwareFlowControl_None;
	USART_InitStruct.USART_BaudRate =9600;
	USART_InitStruct.USART_Parity =USART_Parity_No;
	USART_InitStruct.USART_StopBits =USART_StopBits_1;
	USART_InitStruct.USART_WordLength =USART_WordLength_8b;
	USART_Init(USART1,&USART_InitStruct);
	
	//开串口接收中断
	//中断标志一定是外设加杠加IT，不是FLAG
	USART_ITConfig(USART1,USART_IT_RXNE,ENABLE);
	
	//配置NVIC
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	NVIC_InitTypeDef NVIC_InitStruct;
	NVIC_InitStruct.NVIC_IRQChannel =USART1_IRQn;
	NVIC_InitStruct.NVIC_IRQChannelCmd =ENABLE;
	NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority =1;
	NVIC_InitStruct.NVIC_IRQChannelSubPriority =1;
	NVIC_Init(&NVIC_InitStruct);
	
	//启动串口
	USART_Cmd(USART1,ENABLE);
}


void Serial_Byte(uint8_t data)
{
	USART_SendData(USART1,data);
	while(USART_GetFlagStatus(USART1,USART_FLAG_TXE) == RESET);
}
void Serial_Arr(uint8_t *arr,uint16_t len)
{
	for(uint16_t i = 0; i < len; i++)
	{
		Serial_Byte(arr[i]);
	}
}
void Serial_String(char *str)
{
	while(*str)
	{
		Serial_Byte(*str++);
	}
}
void Serial_Number(uint32_t num)
{
	char arr[11] ;
	uint16_t index = 10;
	arr[index] = '\0';
	do{
		arr[--index] = num%10 + '0';
		num /= 10;
	}while(num!=0);
	Serial_String(&arr[index]);
}

int fputc(int ch, FILE* fp)
{
	Serial_Byte(ch);
	return ch;
}
char message[100];
void USART1_IRQHandler(void)
{
	static uint8_t index = 0;
	if(USART_GetITStatus(USART1,USART_IT_RXNE) == SET)
	{
		//接收发送的数据
		uint8_t data = USART_ReceiveData(USART1);	
		if(data == '@')
		{
			index = 0;
		}else if(data != '\r' && data != '\n')
		{
			//将收到的数据放在数组中
			message[index++] = data;
		}else if(data == '\n')
		{
			message[index] = '\0';
			dealTask();
		}
		USART_ClearITPendingBit(USART1,USART_IT_RXNE);
	}
}
void dealTask(void)
{
	if(strcmp( message,"LED_ON") == 0)
	{
		LED1_On();
		//printf("%s","开灯成功");
		printf("%s","OS");
	}else if(strcmp( message,"LED_OFF") == 0)
	{
		LED1_Off();
		printf("%s","CS");
	}else
	{
		printf("%s","unrecongnize error");
	}
}
